{
  "book": [
    {
      "id": "1",
      "titulo": "Cien años de soledad",
      "descripcion": "Una de las obras más representativas del realismo mágico, escrita por el ganador del Premio Nobel Gabriel García Márquez. La novela narra la historia de la familia Buendía a lo largo de siete generaciones en el pueblo ficticio de Macondo, un lugar donde lo extraordinario y lo sobrenatural conviven con la vida cotidiana.",
      "resumen": "Cien años de soledad sigue la vida de los Buendía, desde su fundador José Arcadio Buendía, hasta su última generación. La novela retrata temas como el amor, la soledad, la fatalidad, la historia cíclica y el poder del destino.",
      "fecha_publicacion": "1967-06-05",
      "isbn": "978-0307474728",
      "formato": "Tapa blanda",
      "precio": "$0.00",
      "ruta_archivo": "https://www.sev.gob.mx/clasesdesdecasa/documentos/c8cf01c83fcd163f06e727cabcff90ac100-a%C3%B1os-de-soledad-Gabriel-Garc%C3%ADa-Marquez.pdf",
      "portada": "https://images.cdn3.buscalibre.com/fit-in/360x360/61/8d/618d227e8967274cd9589a549adff52d.jpg"
    },
    {
      "id": "2",
      "titulo": "1984",
      "descripcion": "Escrita por George Orwell, 1984 es una novela distópica que explora un mundo donde el gobierno controla todos los aspectos de la vida, desde el pensamiento hasta la historia misma. El término 'Gran Hermano' proviene de esta novela y simboliza la vigilancia extrema.",
      "resumen": "Winston Smith trabaja para el Partido, el gobierno totalitario que manipula la verdad y espía a sus ciudadanos. A través de su narrativa, Orwell aborda temas como la propaganda, la opresión política, y el control del lenguaje como una herramienta para el poder.",
      "fecha_publicacion": "1949-06-08",
      "isbn": "978-0451524935",
      "formato": "Tapa dura",
      "precio": "$0.00",
      "ruta_archivo": "https://ocw.uca.es/pluginfile.php/1485/mod_resource/content/1/1984.pdf",
      "portada": "https://www.laorquestafilosofica.com/wp-content/uploads/2018/01/externo-4c157cb101737ebd5e9f10f29aa31730.jpg"
    },
    {
      "id": "3",
      "titulo": "El gran Gatsby",
      "descripcion": "Una de las novelas más icónicas de la literatura estadounidense, escrita por F. Scott Fitzgerald. El gran Gatsby se centra en la vida de Jay Gatsby, un hombre misterioso y adinerado, y su obsesión por recuperar el amor perdido de Daisy Buchanan.",
      "resumen": "A través de los ojos del narrador Nick Carraway, Fitzgerald revela las contradicciones del sueño americano: riqueza, ambición y corrupción moral. La historia refleja la vida en la alta sociedad de Nueva York en los años 20, y cómo el dinero no puede comprar la felicidad o cambiar el pasado.",
      "fecha_publicacion": "1925-04-10",
      "isbn": "978-0743273565",
      "formato": "Tapa blanda",
      "precio": "$0.00",
      "ruta_archivo": "https://www.imprentanacional.go.cr/editorialdigital/libros/literatura%20universal/el_gran_gatsby_edincr.pdf",
      "portada": "https://beta.acuedi.org/storage/books/cover/10411.pdf.jpg"
    },
    {
      "id": "4",
      "titulo": "Matar a un ruiseñor",
      "descripcion": "Una novela escrita por Harper Lee que se adentra en la injusticia racial en el sur de Estados Unidos durante la Gran Depresión. A través de los ojos de la joven Scout Finch, se observa el juicio de un hombre negro acusado falsamente de violar a una mujer blanca.",
      "resumen": "El padre de Scout, Atticus Finch, abogado y modelo de integridad moral, defiende al hombre acusado, lo que genera tensiones en la comunidad. La novela aborda temas como la moralidad, la empatía y el prejuicio, convirtiéndose en un llamado a la justicia y la igualdad.",
      "fecha_publicacion": "1960-07-11",
      "isbn": "978-0060935467",
      "formato": "Tapa dura",
      "precio": "$0.00",
      "ruta_archivo": "https://web.seducoahuila.gob.mx/biblioweb/upload/Harper,%20Lee%20-%20Matar%20Un%20Ruise%C3%B1or.pdf",
      "portada": "https://img.perlego.com/book-covers/3633976/9780063026032.jpg"
    },
    {
      "id": "5",
      "titulo": "Sumérgete en los Patrones de Diseño",
      "descripcion": "Este libro es una guía moderna y detallada sobre cómo aplicar patrones de diseño a proyectos de software. Es ideal para desarrolladores que desean mejorar la arquitectura de sus sistemas y escribir código más limpio y escalable.",
      "resumen": "A través de ejemplos claros y concisos, el libro cubre los patrones de diseño más populares, como el Singleton, el Adapter y el Observer, mostrando cómo se pueden implementar en lenguajes de programación modernos. Ideal tanto para principiantes como para programadores experimentados.",
      "fecha_publicacion": "2022-07-15",
      "isbn": "978-1492052203",
      "formato": "Tapa dura",
      "precio": "$30.00",
      "ruta_archivo": "https://refactoring.guru/es/design-patterns/book",
      "portada": "https://refactoring.guru/images/patterns/book/web-cover-es.png"
    },
    {
      "id": "6",
      "titulo": "El algoritmo maestro: Cómo la búsqueda del algoritmo definitivo remodelará nuestro mundo",
      "descripcion": "Escrito por Pedro Domingos, este libro ofrece una fascinante exploración del aprendizaje automático y cómo los algoritmos están transformando industrias enteras, desde la medicina hasta las finanzas.",
      "resumen": "Domingos presenta las cinco corrientes principales del aprendizaje automático y explica cómo se pueden combinar en lo que él llama el 'algoritmo maestro', un algoritmo que podría aprender cualquier tarea humana. Una lectura esencial para cualquiera interesado en la inteligencia artificial y su impacto en el mundo.",
      "fecha_publicacion": "2021-01-12",
      "isbn": "978-0465065707",
      "formato": "Tapa blanda",
      "precio": "$10.00",
      "ruta_archivo": "https://archive.org/details/the-master-algorithm",
      "portada": "https://cdn.bookey.app/files/publish-book/the-master-algorithm.jpg"
    },
    {
      "id": "7",
      "titulo": "The Pragmatic Programmer: Your Journey to Mastery",
      "descripcion": "Una obra clásica en el mundo del desarrollo de software que ofrece consejos prácticos y principios fundamentales para programadores de todos los niveles. Escrito por Dave Thomas y Andy Hunt, este libro enseña cómo ser un programador más eficiente y adaptable.",
      "resumen": "Desde la escritura de código limpio hasta la gestión de proyectos, The Pragmatic Programmer cubre una amplia gama de temas importantes para los desarrolladores. Cada capítulo está lleno de anécdotas y ejemplos que ayudan a mejorar las habilidades de programación en la vida real.",
      "fecha_publicacion": "2019-09-13",
      "isbn": "978-0135957059",
      "formato": "Tapa blanda",
      "precio": "$37.99",
      "ruta_archivo": "https://www.amazon.com/Pragmatic-Programmer-journey-mastery-Anniversary/dp/0135957052",
      "portada": "https://m.media-amazon.com/images/I/41as+WafrFL._SX404_BO1,204,203,200_.jpg"
    },
    {
      "id": "8",
      "titulo": "Deep Learning with Python",
      "descripcion": "Escrito por François Chollet, creador de la biblioteca Keras, este libro ofrece una introducción clara y práctica al aprendizaje profundo (deep learning) con Python. Es ideal para aquellos que desean aprender a implementar redes neuronales profundas.",
      "resumen": "A lo largo del libro, Chollet proporciona ejemplos prácticos y tutoriales que cubren temas como redes neuronales convolucionales, aprendizaje supervisado y no supervisado, y cómo aplicar estas técnicas a problemas del mundo real como el reconocimiento de imágenes y el procesamiento del lenguaje natural.",
      "fecha_publicacion": "2021-01-21",
      "isbn": "978-1617296868",
      "formato": "Tapa blanda",
      "precio": "$37.99",
      "ruta_archivo": "https://www.amazon.com/Deep-Learning-Python-Francois-Chollet/dp/1617296864",
      "portada": "https://is1-ssl.mzstatic.com/image/thumb/Publication116/v4/45/d7/9f/45d79f50-fcb4-ab23-8bc0-65e4abc144d8/9781638350095.jpg/1200x1200wz.jpg"
    },
    {
      "id": "9",
      "titulo": "The Psychology of Money: Timeless Lessons on Wealth, Greed, and Happiness",
      "descripcion": "Este libro de Morgan Housel aborda cómo nuestras emociones y decisiones afectan nuestras finanzas, ofreciendo lecciones atemporales sobre riqueza, avaricia y felicidad.",
      "resumen": "Housel explora cómo el comportamiento humano influye en nuestras decisiones financieras. Utiliza historias y estudios de caso para ilustrar cómo la mentalidad y las emociones juegan un papel clave en la acumulación de riqueza y cómo tomar decisiones más racionales en cuanto al dinero puede mejorar nuestra vida.",
      "fecha_publicacion": "2020-09-08",
      "isbn": "978-0857197689",
      "formato": "Tapa dura",
      "precio": "$19.99",
      "ruta_archivo": "https://www.amazon.com/Psychology-Money-Timeless-lessons-happiness/dp/0857197681",
      "portada": "https://images.cdn1.buscalibre.com/fit-in/360x360/c2/c3/c2c37a6b510585dfa3c775921721b02a.jpg"
    },
    {
      "id": "10",
      "titulo": "Sapiens: A Brief History of Humankind",
      "descripcion": "Una obra maestra de Yuval Noah Harari que ofrece una visión profunda y completa de la historia de la humanidad, desde la evolución de los Homo sapiens hasta la revolución digital.",
      "resumen": "Harari examina cómo el Homo sapiens ha llegado a dominar el planeta, explorando revoluciones clave como la cognitiva, la agrícola y la científica. El libro aborda cuestiones de biología, historia y antropología, proporcionando un análisis detallado de cómo llegamos hasta donde estamos y hacia dónde nos dirigimos.",
      "fecha_publicacion": "2015-02-10",
      "isbn": "978-0062316110",
      "formato": "Tapa dura",
      "precio": "$22.99",
      "ruta_archivo": "https://www.amazon.com/Sapiens-Brief-History-Humankind/dp/0062316117",
      "portada": "https://m.media-amazon.com/images/I/713jIoMO3UL._AC_UL320_.jpg"
    }
  ]
}
